config/soaprequests/passwordResetByAdmin.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://org.apache.axis2/xsd">
   <soapenv:Header/>
   <soapenv:Body>
      <xsd:changePassword>
         <!--Optional:-->
         <xsd:userName>bsu.com/kwinters</xsd:userName>
         <!--Optional:-->
         <xsd:newPassword>Password1</xsd:newPassword>
      </xsd:changePassword>
   </soapenv:Body>
</soapenv:Envelope>